First deal with the imports. Import Pandas and NumPy. We primarily use the shortcut/alias names to make typing them easier. That, and these aliases are fairly universal - most documentation you read is likely to have them written this way.

In [1]:
import pandas as pd
import numpy as np

Below, we are importing a list of integers. In this case, it might be grades for a test. Here we use the Pandas library (pd) to create a Pandas object called a _Series_.

In [2]:
series_a = pd.Series([90,85,88,86,91,79,82,65,88,87,96])

If you are familiar with tabular data (CSV, Excel, Google Sheets, etc.) a series is similar to a single column. Similar in that it has a single column of values, but automatically assigns an index to the values as well. This is SUPER important - Pandas LOVES a good index.

In [3]:
series_a

0     90
1     85
2     88
3     86
4     91
5     79
6     82
7     65
8     88
9     87
10    96
dtype: int64

In [4]:
series_a.shape

(11L,)

Pandas provides some methods to series. Here we can easily calculate the mean and median.

In [5]:
print series_a.mean()
print series_a.median()

85.1818181818
87.0

You can even drop duplicate values. If you are curious about what is available to you within a certain context, press `tab` after the series name and you can see the methods. You can even select from the dropdown list with the arrow keys and `enter` to confirm. Below is the `.drop_duplicates()` method. It will drop any entries whose values have already been represented above it in the Series. Notice that the second 88 (position 8) is dropped?

In [7]:
series_a.drop_duplicates()

0     90
1     85
2     88
3     86
4     91
5     79
6     82
7     65
9     87
10    96
dtype: int64

Many times, there are defaults for methods. In this case, `.drop_duplicates()` assumes you want to keep the first. What if you want to keep the last?

In [8]:
series_a.drop_duplicates(keep='last')

0     90
1     85
3     86
4     91
5     79
6     82
7     65
8     88
9     87
10    96
dtype: int64

For the most part, unless you say specifically, the functions are not destructive. Even though we dropped the duplicates, they're still in there when we call the Series.

In [9]:
series_a

0     90
1     85
2     88
3     86
4     91
5     79
6     82
7     65
8     88
9     87
10    96
dtype: int64

Let's assign some usernames. First establish a list. Then, like before, we pass that list to Pandas and create a Series:

In [11]:
student_names = pd.Series(['WHARTNE','PTROUGH','JPERTWE','TBAKER','PDAVISO','CBAKER',
                 'SMCCOY','PMCGANN','CECCLES','DTENNAN','MSMITH','PCAPALD'])

Also, like before, Pandas has assigned an index to our list.

In [12]:
student_names

0     WHARTNE
1     PTROUGH
2     JPERTWE
3      TBAKER
4     PDAVISO
5      CBAKER
6      SMCCOY
7     PMCGANN
8     CECCLES
9     DTENNAN
10     MSMITH
11    PCAPALD
dtype: object

By using dictionaries (another python object that we'll talk about later. Note the `{}`) we can concatenate two series together on a specific axis, and name the columns at the same time. Below, we are creating an object called a DataFrame from two Series. Simply put, a DataFrame is a Series of one or more Series. In this case, we are aligning them as columns next to each other, so we are saying `axis=1`.

In [13]:
grades = pd.concat({'Names':student_names,'Midterm':series_a},axis=1)
grades
# grades.transpose().sort_index(ascending=False)

    Midterm    Names
0      90.0  WHARTNE
1      85.0  PTROUGH
2      88.0  JPERTWE
3      86.0   TBAKER
4      91.0  PDAVISO
5      79.0   CBAKER
6      82.0   SMCCOY
7      65.0  PMCGANN
8      88.0  CECCLES
9      87.0  DTENNAN
10     96.0   MSMITH
11      NaN  PCAPALD

If you are confused about **axis=0** vs. **axis=1**, watch what happens when we `.concat()` on **axis=0**:

In [14]:
axisTest = pd.concat([series_a,student_names],axis=0)
axisTest

0          90
1          85
2          88
3          86
4          91
5          79
6          82
7          65
8          88
9          87
10         96
0     WHARTNE
1     PTROUGH
2     JPERTWE
3      TBAKER
4     PDAVISO
5      CBAKER
6      SMCCOY
7     PMCGANN
8     CECCLES
9     DTENNAN
10     MSMITH
11    PCAPALD
dtype: object

I like to think of `axis=0` as being vertical - you are adding rows to a Series or Dataframe at the bottom of the current object. By contrast, `axis=1` is horizontal. You are adding columns to the right of the current object. *I hope that didn't confuse matters further.*

When concatenating Series into a DataFrame, Pandas will do its best to align them by the index. In this case, however, we have more names than grades. Pandas and NumPy know this, and added a `NaN` where data was missing. `NaN` is NumPy's way of saying there is **N**ot **a** **N**umber here, and should be recognized as being invalid.

To correct this cell, it should be a simple matter of providing the coordinates of the cell, and assigning the value.

..._well, it should be easy..._

In [15]:
grades[1,11] = 85
grades

    Midterm    Names  (1, 11)
0      90.0  WHARTNE       85
1      85.0  PTROUGH       85
2      88.0  JPERTWE       85
3      86.0   TBAKER       85
4      91.0  PDAVISO       85
5      79.0   CBAKER       85
6      82.0   SMCCOY       85
7      65.0  PMCGANN       85
8      88.0  CECCLES       85
9      87.0  DTENNAN       85
10     96.0   MSMITH       85
11      NaN  PCAPALD       85

Since we did not format the cell coordinates correctly, Pandas assumed that we were creating a new column and setting its values to the grade specified. That obviously didn't work, so let's delete it using the `.drop()` method. Be sure to specify the axis, in case you have a row named the same as one of your columns (hey, it's possible). Also, let's reassign the edited DataFrame back to itself. Otherwise, the `.drop()` function just returns a **view** of the grades DataFrame with the column dropped, without actually dropping it.

In [16]:
grades = grades.drop((1,11),axis=1)

In [17]:
grades

    Midterm    Names
0      90.0  WHARTNE
1      85.0  PTROUGH
2      88.0  JPERTWE
3      86.0   TBAKER
4      91.0  PDAVISO
5      79.0   CBAKER
6      82.0   SMCCOY
7      65.0  PMCGANN
8      88.0  CECCLES
9      87.0  DTENNAN
10     96.0   MSMITH
11      NaN  PCAPALD

Now, let's look at ways to index into a Series and DataFrame. There are three indexing methods:
- `.ix[]`
- `.loc[]`
- `.iloc[]`

The first, `.ix[]` will be removed in future versions of Pandas. It will work, but with warnings. I've included it here as a lot of documentation still references it.

In [44]:
grades.loc[7,'Midterm']

65.0

We have used the .loc[] and supplied the row with the index 7, and the column 'Midterm'. For now, something like this is as simple as we need to be. We will DEFINITELY be coming back to this...

In the meantime, let's fill that space with a grade using '=', the assignment operator.

In [20]:
grades.loc[11,'Midterm'] = 85

Checking the DataFrame, we can see that the grade is in the right place.

In [21]:
grades

    Midterm    Names
0      90.0  WHARTNE
1      85.0  PTROUGH
2      88.0  JPERTWE
3      86.0   TBAKER
4      91.0  PDAVISO
5      79.0   CBAKER
6      82.0   SMCCOY
7      65.0  PMCGANN
8      88.0  CECCLES
9      87.0  DTENNAN
10     96.0   MSMITH
11     85.0  PCAPALD

We can also check the datatypes of the variables thus far:

In [23]:
type(series_a)

pandas.core.series.Series

In [24]:
type(grades)

pandas.core.frame.DataFrame

The `.info()` method provides a little more detail about the object. In this case, we'll look at the grades DataFrame.

In [25]:
grades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
Midterm    12 non-null float64
Names      12 non-null object
dtypes: float64(1), object(1)
memory usage: 264.0+ bytes

We can see information about the column heads.

In [26]:
grades.columns

Index([u'Midterm', u'Names'], dtype='object')

Here is some statistical information about the numerical column(s).

In [28]:
grades.describe()
#grades.describe(percentiles=[.2,.3,.4,.5])

         Midterm
count  12.000000
mean   85.166667
std     7.685090
min    65.000000
25%    84.250000
50%    86.500000
75%    88.500000
max    96.000000

Masking
--
Masking is a way of hiding (or showing) cells based upon a Series/DataFrame of boolean (True/False) values. It is a very powerful way to do queries, provided you are willing to do a little work on the front end.

Perhaps, we want to see every row where the 'Midterm' is greater than 85.

In [30]:
grade_threshold = 85
grades['Midterm'] > grade_threshold

0      True
1     False
2      True
3      True
4      True
5     False
6     False
7     False
8      True
9      True
10     True
11    False
Name: Midterm, dtype: bool

We can also assign this list of boolean values to a variable, and use it as a mask.

In [31]:
b_threshold = grades['Midterm'] > grade_threshold
grades[b_threshold]

    Midterm    Names
0      90.0  WHARTNE
2      88.0  JPERTWE
3      86.0   TBAKER
4      91.0  PDAVISO
8      88.0  CECCLES
9      87.0  DTENNAN
10     96.0   MSMITH

Let's add some more grades into this class. We'll use the NumPy random integer method...

In [33]:
np.random.randint(69,high=100,size=12)

array([76, 80, 78, 88, 72, 90, 85, 97, 71, 85, 91, 75])

...and assign it to the final variable. Don't worry if your numbers look different. Each time this page is re-run, the random number generator will create a new list. In fact, this second execution is different from the first. See?

In [34]:
final = pd.Series(np.random.randint(69,high=100,size=12))

In [35]:
final

0     94
1     85
2     73
3     88
4     77
5     77
6     71
7     90
8     98
9     98
10    81
11    89
dtype: int32

Now, let's use the `.concat()` method to concatenate the grades DataFrame with the final Series on axis 1. We'll go ahead and explicitly name the columns as well.

In [36]:
grades_final = pd.concat([grades,final],axis=1)
grades_final.columns = ['Midterm','Names','Final']

In [37]:
grades_final

    Midterm    Names  Final
0      90.0  WHARTNE     94
1      85.0  PTROUGH     85
2      88.0  JPERTWE     73
3      86.0   TBAKER     88
4      91.0  PDAVISO     77
5      79.0   CBAKER     77
6      82.0   SMCCOY     71
7      65.0  PMCGANN     90
8      88.0  CECCLES     98
9      87.0  DTENNAN     98
10     96.0   MSMITH     81
11     85.0  PCAPALD     89

The index on the left doesn't make much sense in the context of the grades, so let's make the index equal to the names, and reassign to the `grades_final` DataFrame.

In [38]:
grades_final = grades_final.set_index('Names')

In [39]:
grades_final

         Midterm  Final
Names
WHARTNE     90.0     94
PTROUGH     85.0     85
JPERTWE     88.0     73
TBAKER      86.0     88
PDAVISO     91.0     77
CBAKER      79.0     77
SMCCOY      82.0     71
PMCGANN     65.0     90
CECCLES     88.0     98
DTENNAN     87.0     98
MSMITH      96.0     81
PCAPALD     85.0     89

Now, let's add another column to the DataFrame, averaging the values in each row.

In [40]:
grades_final['Avg.'] = grades_final.mean(axis=1)
grades_final

         Midterm  Final  Avg.
Names
WHARTNE     90.0     94  92.0
PTROUGH     85.0     85  85.0
JPERTWE     88.0     73  80.5
TBAKER      86.0     88  87.0
PDAVISO     91.0     77  84.0
CBAKER      79.0     77  78.0
SMCCOY      82.0     71  76.5
PMCGANN     65.0     90  77.5
CECCLES     88.0     98  93.0
DTENNAN     87.0     98  92.5
MSMITH      96.0     81  88.5
PCAPALD     85.0     89  87.0

Now, let's make a mask **in place**, getting every average greater than some grade.

In [41]:
grades_final[grades_final['Avg.']>85]

         Midterm  Final  Avg.
Names
WHARTNE     90.0     94  92.0
TBAKER      86.0     88  87.0
CECCLES     88.0     98  93.0
DTENNAN     87.0     98  92.5
MSMITH      96.0     81  88.5
PCAPALD     85.0     89  87.0

We're not limited to built-in functions for extra cells, we can even make a weighted average for the two grades:

In [42]:
grades_final['W.Avg.'] = (grades_final['Midterm'] *.4 + grades_final['Final'] *.6)
grades_final

         Midterm  Final  Avg.  W.Avg.
Names
WHARTNE     90.0     94  92.0    92.4
PTROUGH     85.0     85  85.0    85.0
JPERTWE     88.0     73  80.5    79.0
TBAKER      86.0     88  87.0    87.2
PDAVISO     91.0     77  84.0    82.6
CBAKER      79.0     77  78.0    77.8
SMCCOY      82.0     71  76.5    75.4
PMCGANN     65.0     90  77.5    80.0
CECCLES     88.0     98  93.0    94.0
DTENNAN     87.0     98  92.5    93.6
MSMITH      96.0     81  88.5    87.0
PCAPALD     85.0     89  87.0    87.4

Using a boolean AND `&` or a boolean OR `|` we can combine masks to have compound results.

In [43]:
grades_final[(grades_final['Avg.'] > 85) | (grades_final['Midterm'] > 80)]

         Midterm  Final  Avg.  W.Avg.
Names
WHARTNE     90.0     94  92.0    92.4
PTROUGH     85.0     85  85.0    85.0
JPERTWE     88.0     73  80.5    79.0
TBAKER      86.0     88  87.0    87.2
PDAVISO     91.0     77  84.0    82.6
SMCCOY      82.0     71  76.5    75.4
CECCLES     88.0     98  93.0    94.0
DTENNAN     87.0     98  92.5    93.6
MSMITH      96.0     81  88.5    87.0
PCAPALD     85.0     89  87.0    87.4